ConfigFiles/Reports/ОшибкиПрисутствующиеВВерсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОшибкиПрисутствующиеВВерсии</Name>
		</Properties>
	</Report>
</MetaDataObject>

ConfigFiles/Catalogs/ВерсииПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииПроекта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияМеханизмаОбновленияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформыХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияБиблиотек</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиКПредварительномуВстраиванию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВнешнегоТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРазработки</Name>
					<Comment>Начало разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРазработки</Name>
					<Comment>Окончание разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредстоящейСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияПоддержки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодредакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликуемыйНомерВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПатчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииВключаемыхПроектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВИменахМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВСоставеПодсистем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНужноДобавитьВПодсистему</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Reports/ОшибкиПрисутствующиеВВерсии/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидимостьКомандВариантовОтчетов") Тогда
		ДоступенВыборВарианта = Параметры.ВидимостьКомандВариантовОтчетов;
	Иначе
		ДоступенВыборВарианта = Истина;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(Элементы, ВидОтчета, ДоступенВыборВарианта);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьДоступностьЭлементов(Элементы, ВидОтчета, ДоступенВыборВарианта);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	ОтчетыПереопределяемый.УстановитьМакетОформленияВРежимеТакси(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов(Элементы, ВидОтчета, ДоступенВыборВарианта);
	ОтчетТабличныйДокумент = Новый ТабличныйДокумент;
	ТекстHTML="";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьОтчетСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Расширение = "htm";
	Диалог.Фильтр = "htm";
	
	Диалог.ПолноеИмяФайла = Диалог.Каталог + ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		
		ВыбранноеИмяФайла = Диалог.ПолноеИмяФайла;
		ОтчетТХТ.Записать(ВыбранноеИмяФайла);
		
		ТекстОповещения = НСтр("ru='Отчет сохранен в файл'");
		ПоказатьОповещениеПользователя(ТекстОповещения,,, БиблиотекаКартинок.Информация32);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетСервер()	
	
	Если ВидОтчета = 0 Тогда
		СкомпоноватьРезультат();
	Иначе
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		
		МакетТХТ = ОтчетОбъект.ПолучитьМакет("МакетHTML");
		СхемаКомпоновки = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		
		ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Отчет.КомпоновщикНастроек.ПолучитьНастройки(),,,ТипГенератора);
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		ТаблицаОшибок = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		СформироватьHTML(ТаблицаОшибок, МакетТХТ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьHTML(ТаблицаОшибок, МакетТХТ)
	
	Проект = Справочники.Проекты.ПустаяСсылка();
	Версия = Справочники.ВерсииПроекта.ПустаяСсылка();
	
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПроект = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Проект"));
	Если ПараметрПроект <> Неопределено Тогда
		Проект = ПараметрПроект.Значение;
	КонецЕсли;
	
	ПараметрВерсия = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Версия"));
	Если ПараметрВерсия <> Неопределено Тогда
		Версия = ПараметрВерсия.Значение;
	КонецЕсли;
	
	ПараметрСборка = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сборка"));
	Если ПараметрСборка <> Неопределено Тогда
		Сборка = ПараметрСборка.Значение;
	КонецЕсли;
	
	РеквизитыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, "ИмяКонфигурации, НаименованиеКонфигурации");
	
	ПроектИмя = РеквизитыПроекта.ИмяКонфигурации;
	ПроектНаименование = РеквизитыПроекта.НаименованиеКонфигурации;
	
	РеквизитыВерсии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Версия, "Код, ПубликуемыйНомерВерсии");
	РеквизитыСборки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Сборка, "Код, ПубликуемыйНомерСборки");
	
	ВерсияПроектаКод = ?(ЗначениеЗаполнено(РеквизитыВерсии.ПубликуемыйНомерВерсии),
		РеквизитыВерсии.ПубликуемыйНомерВерсии, РеквизитыВерсии.Код);
	
	СборкаВерсииКод = ?(ЗначениеЗаполнено(РеквизитыСборки.ПубликуемыйНомерСборки),
		РеквизитыСборки.ПубликуемыйНомерСборки, РеквизитыСборки.Код);
	
	ИмяФайла = ПроектИмя + ". Версия " + СборкаВерсииКод + ". Информация об ошибках";
	
	ОтчетТХТ.Очистить();
	
	ОбластьЗаголовокНачало = МакетТХТ.ПолучитьОбласть("ЗаголовокНачало");
	ОбластьЗаголовокНачало.УдалитьСтроку(7);
	ОбластьЗаголовокНачало.УдалитьСтроку(1);
	ОтчетТХТ.ДобавитьСтроку(ОбластьЗаголовокНачало.ПолучитьТекст());
	
	ОбластьЗаголовокКонец = МакетТХТ. ПолучитьОбласть("ЗаголовокКонец");
	ОбластьЗаголовокКонец.УдалитьСтроку(3);
	ОбластьЗаголовокКонец.УдалитьСтроку(1);
	ОтчетТХТ.ДобавитьСтроку(ОбластьЗаголовокКонец.ПолучитьТекст());
	
	ОбластьНачалоТела = МакетТХТ.ПолучитьОбласть("НачалоТела");
	ОбластьНачалоТела.УдалитьСтроку(10);
	ОбластьНачалоТела.УдалитьСтроку(1);
	ТекстОбласти = ОбластьНачалоТела.ПолучитьТекст();
	ТекстОбласти = СтрЗаменить(ТекстОбласти, "[НаименованиеПроекта]", ПроектНаименование);
	ТекстОбласти = СтрЗаменить(ТекстОбласти, "[НомерВерсии]"        , СборкаВерсииКод);
	ОтчетТХТ.ДобавитьСтроку(ТекстОбласти);
	
	ОбластьЗаголовокОшибки = МакетТХТ.ПолучитьОбласть("ЗаголовокОшибки");
	ОбластьОписаниеОшибки = МакетТХТ.ПолучитьОбласть("ОписаниеОшибки");
	
	ОбластьЗаголовокОшибки.УдалитьСтроку(12);
	ОбластьЗаголовокОшибки.УдалитьСтроку(1);
	
	ОбластьОписаниеОшибки.УдалитьСтроку(7);
	ОбластьОписаниеОшибки.УдалитьСтроку(1);
	
	Для Каждого Ошибка из ТаблицаОшибок Цикл
	
		СтрокаОшибки = СтрЗаменить(ОбластьЗаголовокОшибки.ПолучитьТекст(), "[КодОшибки]", Ошибка.Код);
		ОтчетТХТ.ДобавитьСтроку(СтрокаОшибки);
		
		СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", "Дата&nbsp;публикации");
		СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", Формат(Ошибка.ДатаПервойПубликации,"ДЛФ=ДД"));
		ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
		
		Если ЗначениеЗаполнено(Ошибка.ДатаПоследнегоИзменения) Тогда
			СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", "Дата&nbsp;последнего&nbsp;изменения");
			СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", Формат(Ошибка.ДатаПоследнегоИзменения,"ДЛФ=ДД"));
			ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Ошибка.ПубликуемоеОписаниеОшибки) Тогда
			СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", "Описание");
			ТекстОписания = Ошибка.ПубликуемоеОписаниеОшибки;
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ВК, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС + Символы.ПС, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС, "<BR>");
			СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", ТекстОписания);
			ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Ошибка.СпособИсправления) Тогда
			СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", "Способ&nbsp;исправления");
			ТекстОписания = Ошибка.СпособИсправления;
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ВК, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС + Символы.ПС, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС, "<BR>");
			СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", ТекстОписания);
			ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(Ошибка.СпособОбхода) Тогда
			СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", "Способ&nbsp;обхода");
			ТекстОписания = Ошибка.СпособОбхода;
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ВК, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС + Символы.ПС, Символы.ПС);
			ТекстОписания = СтрЗаменить(ТекстОписания, Символы.ПС, "<BR>");
			СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", ТекстОписания);
			ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ошибка.ВерсияИсправления) ИЛИ ЗначениеЗаполнено(Ошибка.СборкаИсправления) Тогда
			Если ((Ошибка.Проверена И НЕ Ошибка.ИспользоватьЗакрытиеОшибок)
				ИЛИ (Ошибка.Закрыта И Ошибка.ИспользоватьЗакрытиеОшибок))
				И ЗначениеЗаполнено(Ошибка.СборкаИсправления) Тогда
				ПланируетсяИсправлено = "Исправлено&nbsp;в&nbsp;релизе";
				ВерсияИсправления = Ошибка.КодСборкиИсправления;
			Иначе
				ПланируетсяИсправлено = "Планируется&nbsp;исправить&nbsp;в&nbsp;релизе";
				ВерсияИсправления = Ошибка.КодВерсииИсправления;
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ВерсияИсправления) Тогда
				СтрокаПубликации = СтрЗаменить(ОбластьОписаниеОшибки.ПолучитьТекст(), "[Раздел]", ПланируетсяИсправлено);
				СтрокаПубликации = СтрЗаменить(СтрокаПубликации, "[Описание]", ВерсияИсправления);
				ОтчетТХТ.ДобавитьСтроку(СтрокаПубликации);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьОкончаниеТела = МакетТХТ.ПолучитьОбласть("ОкончаниеТела");
	ОбластьОкончаниеТела.УдалитьСтроку(7);
	ОбластьОкончаниеТела.УдалитьСтроку(1);
	ОтчетТХТ.ДобавитьСтроку(ОбластьОкончаниеТела.ПолучитьТекст());
	
	ТекстHTML = ОтчетТХТ.ПолучитьТекст();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Элементы, ВидОтчета, ДоступенВыборВарианта)
	
	Если ВидОтчета=0 Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ТабличныйДокумент;
		Элементы.СохранитьВФайл.Доступность = Ложь;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.HTMLДокумент;
		Элементы.СохранитьВФайл.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ЗагрузитьВариант.Доступность = ДоступенВыборВарианта;
	
КонецПроцедуры

#КонецОбласти
